In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [2]:
### Check for missing data
purchase_data_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [3]:
### Player Count
pcount = purchase_data_df['SN'].value_counts()
pcount

Lisosia93       5
Iral74          4
Idastidru52     4
Lisopela58      3
Pheodaisun84    3
               ..
Siana77         1
Eulolis41       1
Taeduenu92      1
Yadanu52        1
Jiskjask60      1
Name: SN, Length: 576, dtype: int64

In [4]:
### Player Count convert into dataframe
pcount2_df = pd.DataFrame(pcount)
pcount2_df

              SN
Lisosia93      5
Iral74         4
Idastidru52    4
Lisopela58     3
Pheodaisun84   3
...           ..
Siana77        1
Eulolis41      1
Taeduenu92     1
Yadanu52       1
Jiskjask60     1

[576 rows x 1 columns]

In [5]:
### Purchasing Analysis (Number of Unique Items)
count = purchase_data_df["Item Name"].value_counts()
len(count)

179

In [6]:
### Average Purchase Price

average = purchase_data_df["Price"].mean()
average.round(decimals=2)

3.05

In [7]:
### Total Number of Purchases
total_purchases = purchase_data_df["Purchase ID"].count()
total_purchases

780

In [8]:
### Total Revenue
total_revenue = purchase_data_df["Price"].sum()
total_revenue

2379.77

In [9]:
### Table of items above viewed together
purchasing_analysis = pd.DataFrame({"Total Number of Players":[len(pcount)],
    "Number of Unique Items":[len(count)],
                                    "Average Purchase Price":[average.round(decimals=2)],
                                    "Total Number of Purchases":[total_purchases],
                                    "Total Revenue":[total_revenue]})
purchasing_analysis['Total Revenue'] = purchasing_analysis['Total Revenue'].map('${:,.2f}'.format)
purchasing_analysis['Average Purchase Price'] = purchasing_analysis['Average Purchase Price'].map('${:,.2f}'.format)
purchasing_analysis

,Total Number of Players,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,576,179,$3.05,780,"$2,379.77"

In [10]:
male_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Male',]
male_gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [11]:
male_counts = male_gender_df['Gender'].value_counts()
male_counts.head()

Male    652
Name: Gender, dtype: int64

In [12]:
#extract Gender and SN column
gender_group_df = purchase_data_df[['Gender', 'SN']]
gender_group_df

     Gender             SN
0      Male        Lisim78
1      Male    Lisovynya38
2      Male     Ithergue48
3      Male  Chamassasya86
4      Male      Iskosia90
..      ...            ...
775  Female     Aethedru70
776    Male         Iral74
777    Male     Yathecal72
778    Male        Sisur91
779    Male      Ennrian78

[780 rows x 2 columns]

In [13]:

gender_group2_df = gender_group_df.groupby(['Gender'])
gender_group2_df

In [14]:
gender_group2_df['SN'].count
gender_group2_df.head()

                    Gender             SN
0                     Male        Lisim78
1                     Male    Lisovynya38
2                     Male     Ithergue48
3                     Male  Chamassasya86
4                     Male      Iskosia90
9    Other / Non-Disclosed    Chanosian48
15                  Female      Lisassa64
18                  Female      Reunasu60
22   Other / Non-Disclosed   Siarithria38
38                  Female       Reulae52
41                  Female      Assosia88
55                  Female      Phaelap26
82   Other / Non-Disclosed     Haerithp41
111  Other / Non-Disclosed       Sundim98
228  Other / Non-Disclosed    Jiskirran77

In [15]:
male_gender_count = male_gender_df["SN"].value_counts()
len(male_gender_count)

484

In [16]:
female_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Female',]
female_gender_df.head()
female_gender_count = female_gender_df["SN"].value_counts()
len(female_gender_count)

81

In [26]:
other_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Other / Non-Disclosed',]
other_gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [36]:
other_gender_count = other_gender_df["SN"].value_counts()
len(other_gender_count)

11

In [38]:
# other_gender_count.div(11)
# other_gender_count

Idairin51       2
Maluncil97      2
Siarithria38    2
Chanosian48     2
Lirtim36        1
Jiskirran77     1
Sundim98        1
Haerithp41      1
Rairith81       1
Airi27          1
Eodaisu60       1
Name: SN, dtype: int64

In [74]:
raw_count = {
    'Total Count':[len(male_gender_count), len(female_gender_count), len(other_gender_count)],
    'Percentage of Players':[len(male_gender_count)/576*100, 
                             len(female_gender_count)/576*100, 
                             len(other_gender_count)/576*100]   
} 

gender_df = pd.DataFrame(raw_count, index=['Male', 'Female', 'Other / Non-Disclosed'],
                         columns=[
    'Total Count', 'Percentage of Players'])
gender_df

gender_df['Percentage of Players'] = gender_df['Percentage of Players'].map('{:,.2f}%'.format)
gender_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

   Total Count
0          652

Lisosia93       0.006410
Iral74          0.005128
Idastidru52     0.005128
Lisopela58      0.003846
Pheodaisun84    0.003846
                  ...
Siana77         0.001282
Eulolis41       0.001282
Taeduenu92      0.001282
Yadanu52        0.001282
Jiskjask60      0.001282
Name: SN, Length: 576, dtype: float64

In [22]:
count_gender.div(780)*100
percentage = count_gender.div(780)*100
percentage

Lisosia93       0.000822
Iral74          0.000657
Idastidru52     0.000657
Lisopela58      0.000493
Pheodaisun84    0.000493
                  ...
Siana77         0.000164
Eulolis41       0.000164
Taeduenu92      0.000164
Yadanu52        0.000164
Jiskjask60      0.000164
Name: SN, Length: 576, dtype: float64

In [23]:
### Add gender counts to a dataframe
count_gender_df = pd.DataFrame(c_count_gender, percentage)
count_gender_df.head()

NameError: name 'c_count_gender' is not defined

In [24]:
### Group Percentages of each gender

In [ ]:
# Finally, export this file to a spread so we can keep track of out new future watch list without the index
# unknown_movies_df.to_excel("output/movieWatchlist.xlsx", index=False)